In [1]:
import pandas as pd
import numpy as np

## pirma dalis
---

In [2]:
labels = ('vardas', 'pavardė', 'amžius')
zmogus = ('Geras', 'Zmogelis', 33)
print(labels, zmogus)

('vardas', 'pavardė', 'amžius') ('Geras', 'Zmogelis', 33)

In [3]:
pd.Series(data=zmogus)

0       Geras
1    Zmogelis
2          33
dtype: object

In [4]:
pd.Series(data=zmogus, index=labels)

vardas        Geras
pavardė    Zmogelis
amžius           33
dtype: object

In [5]:
zmogus_dict = {
    'vardas': 'Smagus',
    'pavarde': 'Giedriukas',
    'amzius': 36
}
zmogus_dict

{'vardas': 'Smagus', 'pavarde': 'Giedriukas', 'amzius': 36}

In [6]:
zmogus_pd = pd.Series(zmogus_dict)
zmogus_pd

vardas         Smagus
pavarde    Giedriukas
amzius             36
dtype: object

In [7]:
pd.Series(zmogus, labels)

vardas        Geras
pavardė    Zmogelis
amžius           33
dtype: object

In [8]:
zmogus_pd['amzius']

36

In [9]:
miestai = pd.Series((500, 400, 300, 200), ('Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai'))
miestai

Vilnius     500
Kaunas      400
Klaipeda    300
Siauliai    200
dtype: int64

In [10]:
augimas = pd.Series((1.5, 1.3, 0.9, 0.7), ('Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai'))
augimas

Vilnius     1.5
Kaunas      1.3
Klaipeda    0.9
Siauliai    0.7
dtype: float64

In [11]:
miestai * augimas

Vilnius     750.0
Kaunas      520.0
Klaipeda    270.0
Siauliai    140.0
dtype: float64

In [12]:
betko7x7 = np.random.randint(10, 100, (7, 7))
betko7x7

array([[64, 90, 49, 48, 49, 48, 49],
       [52, 12, 98, 14, 19, 34, 28],
       [45, 67, 16, 86, 88, 52, 12],
       [20, 28, 91, 60, 86, 56, 65],
       [27, 73, 24, 55, 83, 32, 92],
       [77, 96, 45, 19, 74, 42, 89],
       [98, 95, 17, 53, 62, 77, 57]])

In [13]:
miestu_skaiciai = pd.DataFrame(
    betko7x7,
    [2000, 2004, 2008, 2012, 2016, 2020, 2024],
    ['Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai', 'Panevezys', 'Alytus', 'Druskininkai']
)
miestu_skaiciai

      Vilnius  Kaunas  Klaipeda  Siauliai  Panevezys  Alytus  Druskininkai
2000       64      90        49        48         49      48            49
2004       52      12        98        14         19      34            28
2008       45      67        16        86         88      52            12
2012       20      28        91        60         86      56            65
2016       27      73        24        55         83      32            92
2020       77      96        45        19         74      42            89
2024       98      95        17        53         62      77            57

In [14]:
miestu_skaiciai['Klaipeda']

2000    49
2004    98
2008    16
2012    91
2016    24
2020    45
2024    17
Name: Klaipeda, dtype: int64

In [15]:
print(type(miestu_skaiciai['Klaipeda']))
print(type(miestu_skaiciai))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [16]:
miestu_skaiciai[['Vilnius', 'Alytus', 'Druskininkai']]

      Vilnius  Alytus  Druskininkai
2000       64      48            49
2004       52      34            28
2008       45      52            12
2012       20      56            65
2016       27      32            92
2020       77      42            89
2024       98      77            57

In [17]:
miestu_skaiciai['Vilnius'][2000] = 99
miestu_skaiciai['Vilnius'][2000]

99

In [18]:
miestu_skaiciai.loc[2012]

Vilnius         20
Kaunas          28
Klaipeda        91
Siauliai        60
Panevezys       86
Alytus          56
Druskininkai    65
Name: 2012, dtype: int64

In [19]:
kazluruda = pd.Series(np.random.randint(10, 99, 7), np.arange(2000, 2025, 4))
kazluruda

2000    80
2004    52
2008    28
2012    47
2016    25
2020    96
2024    61
dtype: int64

In [20]:
miestu_skaiciai['Kazlu Ruda'] = kazluruda
miestu_skaiciai

,Vilnius,Kaunas,Klaipeda,Siauliai,Panevezys,Alytus,Druskininkai,Kazlu Ruda
2000,99,90,49,48,49,48,49,80
2004,52,12,98,14,19,34,28,52
2008,45,67,16,86,88,52,12,28
2012,20,28,91,60,86,56,65,47
2016,27,73,24,55,83,32,92,25
2020,77,96,45,19,74,42,89,96
2024,98,95,17,53,62,77,57,61

In [21]:
miestu_skaiciai.drop('Siauliai', axis=1, inplace=True)

In [22]:
miestu_skaiciai

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      90        49         49      48            49          80
2004       52      12        98         19      34            28          52
2008       45      67        16         88      52            12          28
2012       20      28        91         86      56            65          47
2016       27      73        24         83      32            92          25
2020       77      96        45         74      42            89          96
2024       98      95        17         62      77            57          61

In [23]:
miestai_be_2008 = miestu_skaiciai.drop(2008)
miestai_be_2008

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      90        49         49      48            49          80
2004       52      12        98         19      34            28          52
2012       20      28        91         86      56            65          47
2016       27      73        24         83      32            92          25
2020       77      96        45         74      42            89          96
2024       98      95        17         62      77            57          61

In [24]:
miestu_skaiciai.loc[2008]

Vilnius         45
Kaunas          67
Klaipeda        16
Panevezys       88
Alytus          52
Druskininkai    12
Kazlu Ruda      28
Name: 2008, dtype: int64

In [25]:
miestu_skaiciai.iloc[3]

Vilnius         20
Kaunas          28
Klaipeda        91
Panevezys       86
Alytus          56
Druskininkai    65
Kazlu Ruda      47
Name: 2012, dtype: int64

In [26]:
miestu_skaiciai['Vilnius'][2020]

77

In [27]:
miestu_skaiciai.loc[2020, 'Vilnius']

77

In [28]:
miestu_skaiciai.loc[[2012, 2020, 2024], ['Kaunas', 'Alytus']]

      Kaunas  Alytus
2012      28      56
2020      96      42
2024      95      77

In [29]:
miestu_skaiciai[['Kaunas', 'Alytus']].loc[[2020, 2012, 2000]]

      Kaunas  Alytus
2020      96      42
2012      28      56
2000      90      48

In [30]:
miestu_skaiciai[miestu_skaiciai > 70]

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000     99.0    90.0       NaN        NaN     NaN           NaN        80.0
2004      NaN     NaN      98.0        NaN     NaN           NaN         NaN
2008      NaN     NaN       NaN       88.0     NaN           NaN         NaN
2012      NaN     NaN      91.0       86.0     NaN           NaN         NaN
2016      NaN    73.0       NaN       83.0     NaN          92.0         NaN
2020     77.0    96.0       NaN       74.0     NaN          89.0        96.0
2024     98.0    95.0       NaN        NaN    77.0           NaN         NaN

In [31]:
print(miestu_skaiciai[miestu_skaiciai['Klaipeda'] > 50])

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2004       52      12        98         19      34            28          52
2012       20      28        91         86      56            65          47

In [32]:
miestu_skaiciai[miestu_skaiciai['Klaipeda'] > 80][['Vilnius', 'Klaipeda']]

      Vilnius  Klaipeda
2004       52        98
2012       20        91

In [33]:
miestu_skaiciai[(miestu_skaiciai['Vilnius'] > 90) | (miestu_skaiciai['Klaipeda'] > 80)]

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      90        49         49      48            49          80
2004       52      12        98         19      34            28          52
2012       20      28        91         86      56            65          47
2024       98      95        17         62      77            57          61

In [34]:
miestu_skaiciai.reset_index()

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda
0,2000,99,90,49,49,48,49,80
1,2004,52,12,98,19,34,28,52
2,2008,45,67,16,88,52,12,28
3,2012,20,28,91,86,56,65,47
4,2016,27,73,24,83,32,92,25
5,2020,77,96,45,74,42,89,96
6,2024,98,95,17,62,77,57,61

In [35]:
be_indekso = miestu_skaiciai.reset_index()
be_indekso

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda
0,2000,99,90,49,49,48,49,80
1,2004,52,12,98,19,34,28,52
2,2008,45,67,16,88,52,12,28
3,2012,20,28,91,86,56,65,47
4,2016,27,73,24,83,32,92,25
5,2020,77,96,45,74,42,89,96
6,2024,98,95,17,62,77,57,61

In [36]:
be_indekso['Utena'] = np.random.randint(10, 71, 7)
be_indekso

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
0,2000,99,90,49,49,48,49,80,15
1,2004,52,12,98,19,34,28,52,48
2,2008,45,67,16,88,52,12,28,62
3,2012,20,28,91,86,56,65,47,54
4,2016,27,73,24,83,32,92,25,18
5,2020,77,96,45,74,42,89,96,47
6,2024,98,95,17,62,77,57,61,28

In [37]:
su_utena = be_indekso.set_index('index')
su_utena

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99,90,49,49,48,49,80,15
2004,52,12,98,19,34,28,52,48
2008,45,67,16,88,52,12,28,62
2012,20,28,91,86,56,65,47,54
2016,27,73,24,83,32,92,25,18
2020,77,96,45,74,42,89,96,47
2024,98,95,17,62,77,57,61,28

## antra dalis
---

fiktyviai sugadianm duomenis

In [41]:
su_nuostoliu = su_utena[su_utena > 20]
su_nuostoliu

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99.0,90.0,49.0,49.0,48,49.0,80,NaN
2004,52.0,NaN,98.0,NaN,34,28.0,52,48.0
2008,45.0,67.0,NaN,88.0,52,NaN,28,62.0
2012,NaN,28.0,91.0,86.0,56,65.0,47,54.0
2016,27.0,73.0,24.0,83.0,32,92.0,25,NaN
2020,77.0,96.0,45.0,74.0,42,89.0,96,47.0
2024,98.0,95.0,NaN,62.0,77,57.0,61,28.0

tikrinam duomenų kokybę, kur jų trūksta

In [42]:
su_nuostoliu.isnull()

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,False,False,False,False,False,False,False,True
2004,False,True,False,True,False,False,False,False
2008,False,False,True,False,False,True,False,False
2012,True,False,False,False,False,False,False,False
2016,False,False,False,False,False,False,False,True
2020,False,False,False,False,False,False,False,False
2024,False,False,True,False,False,False,False,False

In [43]:
su_nuostoliu.isnull().sum()

Vilnius         1
Kaunas          1
Klaipeda        2
Panevezys       1
Alytus          0
Druskininkai    1
Kazlu Ruda      0
Utena           2
dtype: int64

In [46]:
su_nuostoliu['Klaipeda'].isnull()

index
2000    False
2004    False
2008     True
2012    False
2016    False
2020    False
2024     True
Name: Klaipeda, dtype: bool

In [47]:
su_nuostoliu['Klaipeda'].isnull().sum()

2

išmetam eilutes, kur duomenų trūksta

In [51]:
su_nuostoliu.dropna()

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2020,77.0,96.0,45.0,74.0,42,89.0,96,47.0

išmetam stulpelius, kur duomenų trūksta

In [49]:
su_nuostoliu.dropna(axis=1)

       Alytus  Kazlu Ruda
index
2000       48          80
2004       34          52
2008       52          28
2012       56          47
2016       32          25
2020       42          96
2024       77          61

išmetam eilutes, kurių stulpelių duomenų kiekis neviršyja thresh

In [54]:
su_nuostoliu.dropna(thresh=7)

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99.0,90.0,49.0,49.0,48,49.0,80,NaN
2012,NaN,28.0,91.0,86.0,56,65.0,47,54.0
2016,27.0,73.0,24.0,83.0,32,92.0,25,NaN
2020,77.0,96.0,45.0,74.0,42,89.0,96,47.0
2024,98.0,95.0,NaN,62.0,77,57.0,61,28.0

išmetam stulpelius, kurių eilučių duomenų kiekis neviršyje thresh

In [55]:
su_nuostoliu.dropna(thresh=6, axis=1)

       Vilnius  Kaunas  Panevezys  Alytus  Druskininkai  Kazlu Ruda
index
2000      99.0    90.0       49.0      48          49.0          80
2004      52.0     NaN        NaN      34          28.0          52
2008      45.0    67.0       88.0      52           NaN          28
2012       NaN    28.0       86.0      56          65.0          47
2016      27.0    73.0       83.0      32          92.0          25
2020      77.0    96.0       74.0      42          89.0          96
2024      98.0    95.0       62.0      77          57.0          61

užpildom nesamus duomenis 'kiauras' reikšme

In [57]:
su_nuostoliu.fillna('kiauras')

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99.0,90.0,49.0,49.0,48,49.0,80,kiauras
2004,52.0,kiauras,98.0,kiauras,34,28.0,52,48.0
2008,45.0,67.0,kiauras,88.0,52,kiauras,28,62.0
2012,kiauras,28.0,91.0,86.0,56,65.0,47,54.0
2016,27.0,73.0,24.0,83.0,32,92.0,25,kiauras
2020,77.0,96.0,45.0,74.0,42,89.0,96,47.0
2024,98.0,95.0,kiauras,62.0,77,57.0,61,28.0

užpildome trūkstamus duomenis stulpelių vidurkiais

In [58]:
su_nuostoliu['Klaipeda'].fillna(value=su_nuostoliu['Klaipeda'].mean())

index
2000    49.0
2004    98.0
2008    61.4
2012    91.0
2016    24.0
2020    45.0
2024    61.4
Name: Klaipeda, dtype: float64

In [62]:
padengti_nuostoliai = su_nuostoliu.fillna(value=su_nuostoliu.mean())
np.round(padengti_nuostoliai, 2)

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99.00,90.00,49.0,49.00,48,49.00,80,47.8
2004,52.00,74.83,98.0,73.67,34,28.00,52,48.0
2008,45.00,67.00,61.4,88.00,52,63.33,28,62.0
2012,66.33,28.00,91.0,86.00,56,65.00,47,54.0
2016,27.00,73.00,24.0,83.00,32,92.00,25,47.8
2020,77.00,96.00,45.0,74.00,42,89.00,96,47.0
2024,98.00,95.00,61.4,62.00,77,57.00,61,28.0

### grupavimas

transponuojam lentelę, kad būtų patogiau dirbti su jos duomenimis

In [63]:
visi_miestai = su_utena.transpose()
visi_miestai

index         2000  2004  2008  2012  2016  2020  2024
Vilnius         99    52    45    20    27    77    98
Kaunas          90    12    67    28    73    96    95
Klaipeda        49    98    16    91    24    45    17
Panevezys       49    19    88    86    83    74    62
Alytus          48    34    52    56    32    42    77
Druskininkai    49    28    12    65    92    89    57
Kazlu Ruda      80    52    28    47    25    96    61
Utena           15    48    62    54    18    47    28

pridedam regionus

In [70]:
regionai = pd.Series([
    'Miestas', 
    'Miestas', 
    'Mazoji Lietuva',
    'Aukstaitija', 
    'Dzukija', 
    'Dzukija', 
    'Mazoji Lietuva', 
    'Aukstaitija'
])
laikini = visi_miestai.reset_index()
laikini['regionai'] = regionai
visi_miestai = laikini.set_index('index')
visi_miestai

index         2000  2004  2008  2012  2016  2020  2024        regionai
index
Vilnius         99    52    45    20    27    77    98         Miestas
Kaunas          90    12    67    28    73    96    95         Miestas
Klaipeda        49    98    16    91    24    45    17  Mazoji Lietuva
Panevezys       49    19    88    86    83    74    62     Aukstaitija
Alytus          48    34    52    56    32    42    77         Dzukija
Druskininkai    49    28    12    65    92    89    57         Dzukija
Kazlu Ruda      80    52    28    47    25    96    61  Mazoji Lietuva
Utena           15    48    62    54    18    47    28     Aukstaitija

sugrupuojam miestus pagal regionus, išvedam vidurkių lentelę

In [72]:
regionais = visi_miestai.groupby('regionai')
regionais.mean(numeric_only=True)

index           2000  2004  2008  2012  2016  2020  2024
regionai
Aukstaitija     32.0  33.5  75.0  70.0  50.5  60.5  45.0
Dzukija         48.5  31.0  32.0  60.5  62.0  65.5  67.0
Mazoji Lietuva  64.5  75.0  22.0  69.0  24.5  70.5  39.0
Miestas         94.5  32.0  56.0  24.0  50.0  86.5  96.5

regionų suma

In [73]:
regionais.sum(numeric_only=True)

index           2000  2004  2008  2012  2016  2020  2024
regionai
Aukstaitija       64    67   150   140   101   121    90
Dzukija           97    62    64   121   124   131   134
Mazoji Lietuva   129   150    44   138    49   141    78
Miestas          189    64   112    48   100   173   193

regionų skaičius (realiai visų duomenų bus vienodas)

In [74]:
regionais.count()

index           2000  2004  2008  2012  2016  2020  2024
regionai
Aukstaitija        2     2     2     2     2     2     2
Dzukija            2     2     2     2     2     2     2
Mazoji Lietuva     2     2     2     2     2     2     2
Miestas            2     2     2     2     2     2     2

min/max

In [75]:
regionais.min()

index           2000  2004  2008  2012  2016  2020  2024
regionai
Aukstaitija       15    19    62    54    18    47    28
Dzukija           48    28    12    56    32    42    57
Mazoji Lietuva    49    52    16    47    24    45    17
Miestas           90    12    45    20    27    77    95

In [78]:
regionais.max() - regionais.min()

index           2000  2004  2008  2012  2016  2020  2024
regionai
Aukstaitija       34    29    26    32    65    27    34
Dzukija            1     6    40     9    60    47    20
Mazoji Lietuva    31    46    12    44     1    51    44
Miestas            9    40    22     8    46    19     3

statistinė analizė vieno stulpelio duomens

In [82]:
regionais[2024].describe()

                count  mean        std   min    25%   50%    75%   max
regionai
Aukstaitija       2.0  45.0  24.041631  28.0  36.50  45.0  53.50  62.0
Dzukija           2.0  67.0  14.142136  57.0  62.00  67.0  72.00  77.0
Mazoji Lietuva    2.0  39.0  31.112698  17.0  28.00  39.0  50.00  61.0
Miestas           2.0  96.5   2.121320  95.0  95.75  96.5  97.25  98.0

In [84]:
regionais[2024].describe().transpose()['Miestas']

count     2.00000
mean     96.50000
std       2.12132
min      95.00000
25%      95.75000
50%      96.50000
75%      97.25000
max      98.00000
Name: Miestas, dtype: float64

### DF jungimas

pasidalinam duomenis

In [95]:
iki_2010 = visi_miestai[['regionai', 2000, 2004, 2008]].copy()
po_2010 = visi_miestai[['regionai', 2012, 2016, 2020, 2024]].copy()

In [96]:
top4 = visi_miestai[:'Panevezys'].copy()
bottom4 = visi_miestai['Alytus':].copy()

In [100]:
pd.concat([top4, bottom4])

index         2000  2004  2008  2012  2016  2020  2024        regionai
index
Vilnius         99    52    45    20    27    77    98         Miestas
Kaunas          90    12    67    28    73    96    95         Miestas
Klaipeda        49    98    16    91    24    45    17  Mazoji Lietuva
Panevezys       49    19    88    86    83    74    62     Aukstaitija
Alytus          48    34    52    56    32    42    77         Dzukija
Druskininkai    49    28    12    65    92    89    57         Dzukija
Kazlu Ruda      80    52    28    47    25    96    61  Mazoji Lietuva
Utena           15    48    62    54    18    47    28     Aukstaitija

In [101]:
pd.concat([top4, bottom4], axis=1)

index,2000,2004,2008,2012,2016,2020,2024,regionai,2000,2004,2008,2012,2016,2020,2024,regionai
index,,,,,,,,,,,,,,,,
Vilnius,99.0,52.0,45.0,20.0,27.0,77.0,98.0,Miestas,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Kaunas,90.0,12.0,67.0,28.0,73.0,96.0,95.0,Miestas,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Klaipeda,49.0,98.0,16.0,91.0,24.0,45.0,17.0,Mazoji Lietuva,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Panevezys,49.0,19.0,88.0,86.0,83.0,74.0,62.0,Aukstaitija,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Alytus,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,48.0,34.0,52.0,56.0,32.0,42.0,77.0,Dzukija
Druskininkai,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,49.0,28.0,12.0,65.0,92.0,89.0,57.0,Dzukija
Kazlu Ruda,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,80.0,52.0,28.0,47.0,25.0,96.0,61.0,Mazoji Lietuva
Utena,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,15.0,48.0,62.0,54.0,18.0,47.0,28.0,Aukstaitija

In [107]:
right4 = bottom4.reset_index()
right4.drop(columns='regionai', inplace=True)
right4

index         index  2000  2004  2008  2012  2016  2020  2024
0            Alytus    48    34    52    56    32    42    77
1      Druskininkai    49    28    12    65    92    89    57
2        Kazlu Ruda    80    52    28    47    25    96    61
3             Utena    15    48    62    54    18    47    28

In [106]:
left4 = top4.reset_index().drop(columns='regionai')
left4

index      index  2000  2004  2008  2012  2016  2020  2024
0        Vilnius    99    52    45    20    27    77    98
1         Kaunas    90    12    67    28    73    96    95
2       Klaipeda    49    98    16    91    24    45    17
3      Panevezys    49    19    88    86    83    74    62

In [108]:
pd.concat([left4, right4], axis=1)

index,index,2000,2004,2008,2012,2016,2020,2024,index,2000,2004,2008,2012,2016,2020,2024
0,Vilnius,99,52,45,20,27,77,98,Alytus,48,34,52,56,32,42,77
1,Kaunas,90,12,67,28,73,96,95,Druskininkai,49,28,12,65,92,89,57
2,Klaipeda,49,98,16,91,24,45,17,Kazlu Ruda,80,52,28,47,25,96,61
3,Panevezys,49,19,88,86,83,74,62,Utena,15,48,62,54,18,47,28

In [116]:
pd.concat([iki_2010, po_2010], axis=1).drop(columns='regionai', axis=1)

index         2000  2004  2008  2012  2016  2020  2024
index
Vilnius         99    52    45    20    27    77    98
Kaunas          90    12    67    28    73    96    95
Klaipeda        49    98    16    91    24    45    17
Panevezys       49    19    88    86    83    74    62
Alytus          48    34    52    56    32    42    77
Druskininkai    49    28    12    65    92    89    57
Kazlu Ruda      80    52    28    47    25    96    61
Utena           15    48    62    54    18    47    28

In [117]:
pd.merge(iki_2010, po_2010, on=['index', 'regionai'])

index               regionai  2000  2004  2008  2012  2016  2020  2024
index
Vilnius              Miestas    99    52    45    20    27    77    98
Kaunas               Miestas    90    12    67    28    73    96    95
Klaipeda      Mazoji Lietuva    49    98    16    91    24    45    17
Panevezys        Aukstaitija    49    19    88    86    83    74    62
Alytus               Dzukija    48    34    52    56    32    42    77
Druskininkai         Dzukija    49    28    12    65    92    89    57
Kazlu Ruda    Mazoji Lietuva    80    52    28    47    25    96    61
Utena            Aukstaitija    15    48    62    54    18    47    28

In [120]:
iki_2010.join(po_2010, lsuffix='', rsuffix=':R').drop(columns='regionai:R')

index               regionai  2000  2004  2008  2012  2016  2020  2024
index
Vilnius              Miestas    99    52    45    20    27    77    98
Kaunas               Miestas    90    12    67    28    73    96    95
Klaipeda      Mazoji Lietuva    49    98    16    91    24    45    17
Panevezys        Aukstaitija    49    19    88    86    83    74    62
Alytus               Dzukija    48    34    52    56    32    42    77
Druskininkai         Dzukija    49    28    12    65    92    89    57
Kazlu Ruda    Mazoji Lietuva    80    52    28    47    25    96    61
Utena            Aukstaitija    15    48    62    54    18    47    28